blog/app/controllers/users_model_controller.rb

SELECT "users_models".* FROM "users_models" WHERE "users_models"."user" = $1 LIMIT 1  [["user", "user1"]]
UPDATE "users_models" SET "count" = 2, "updated_at" = '2013-02-13 16:02:11.271784' WHERE "users_models"."id" = 1
---
	def login(user = params[:user], password = params[:password])
		puts "User: #{user} and password: #{password}"
		if not user.nil?
			@user = UsersModel.find_by_user(user)
			if !@user.nil? && password == @user[:password]
				if @user[:count] != nil
					@user[:count] += 1
				else
					@user[:count] = 1
				end
				@user.save

SELECT "users_models".* FROM "users_models" WHERE "users_models"."user" = 'user1' LIMIT 1
INSERT INTO "users_models" ("count", "created_at", "id", "password", "updated_at", "user") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "user"  [["count", 1], ["created_at", Wed, 13 Feb 2013 10:41:02 UTC +00:00], ["id", nil], ["password", "PASS1"], ["updated_at", Wed, 13 Feb 2013 10:41:02 UTC +00:00], ["user", "user1"]]
---
	def add(user = params[:user], password = params[:password])
		puts "User: #{user} and password: #{password}"
		@user = UsersModel.find_by_user(user)
		if !@user.nil? && !user.nil?
			if @debug
				return {"result" => -2, "output" => {:errCode => -2}.to_json}
			else
				render json: {:errCode => -2}
				return -2 #USER EXISTS
			end
		elsif user.nil? || user.length == 0 || user.length > 128
			if @debug
				return {"result" => -3, "output" => {:errCode => -3}.to_json}
			else
				render json: {:errCode => -3}
				return -3 #BAD USERNAME
			end
		elsif !password.nil? && password.length > 128
			if @debug
				return {"result" => -4, "output" => {:errCode => -4}.to_json}
			else
				render json: {:errCode => -4}
				return -4 #BAD PASSWORD
			end
		else
			@user = UsersModel.new(:user => user, :password => password)
			@user[:count] = 1
			@user.save

DELETE FROM "users_models"
---
	def TESTAPI_resetFixture
		UsersModel.delete_all